# merge placement and meta data in one common csv

In [47]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [48]:
df_iit = pd.read_csv("/Users/anuragchaubey/smart-college-recommender/data/cleaned/iit_placement_cleaned.csv")
df_iiit = pd.read_csv("/Users/anuragchaubey/smart-college-recommender/data/cleaned/iiit_placement_cleaned.csv")
df_nit = pd.read_csv("/Users/anuragchaubey/smart-college-recommender/data/cleaned/nit_placement_cleaned.csv")

In [49]:
df_iiit.head(3)

,year,institute_name,overall_avg_ctc,cse_avg_ctc,ece_avg_ctc,institute_type,cse_vs_ece_gap
0,2020,ABV-IIITM Gwalior,16.85,27.23,16.00,IIIT,11.23
1,2020,IIIT Agartala,22.00,19.50,13.83,IIIT,5.67
2,2020,IIIT Allahabad,20.83,20.83,16.00,IIIT,4.83

In [50]:
df_iit.head(3)

,year,institute_name,overall_avg_ctc,cse_avg_ctc,ece_avg_ctc,ee_avg_ctc,me_avg_ctc
0,2020,IIT Bhilai,11.30,11.82,12.00,11.21,7.51
1,2020,IIT Bhubaneswar,15.80,22.60,15.80,15.80,12.00
2,2020,IIT Bombay,20.08,20.08,17.91,20.08,20.65

In [51]:
df_nit.head(3)

,year,institute_name,overall_avg_ctc,cse_avg_ctc,ece_avg_ctc,ee_avg_ctc,me_avg_ctc,chemical_avg_ctc,civil_avg_ctc
0,2020,IIEST Shibpur,7.30,9.50,16.5,8.00,7.30,6.417747,5.75
1,2020,MNIT Jaipur,9.10,18.39,9.1,9.94,13.20,10.350000,6.00
2,2020,MNNIT Allahabad,17.19,17.68,11.0,17.68,17.68,9.000000,6.54

In [52]:
# add institute_type column in nit iit data
df_iit["institute_type"] = "IIT"
df_nit["institute_type"] = "NIT"

In [53]:
# add cse vs ece gap in nit and iit data
df_iit["cse_vs_ece_gap"] = df_iit["cse_avg_ctc"] - df_iit["ece_avg_ctc"]
df_nit["cse_vs_ece_gap"] = df_nit["cse_avg_ctc"] - df_nit["ece_avg_ctc"]

In [54]:
# add columns which are not there in iit and iiit data with nan values
for df in [df_iiit, df_iit, df_nit]:
    for col in ['ee_avg_ctc', 'me_avg_ctc', 'civil_avg_ctc', 'chemical_avg_ctc']:
        if col not in df.columns:
            df[col] = np.nan

In [55]:
# allign all the columns 
final_columns = [
    'year', 'institute_name', 'institute_type',
    'overall_avg_ctc',
    'cse_avg_ctc', 'ece_avg_ctc','cse_vs_ece_gap', 'ee_avg_ctc',
    'me_avg_ctc', 'civil_avg_ctc', 'chemical_avg_ctc'
]

df_iiit = df_iiit[final_columns]
df_iit = df_iit[final_columns]
df_nit = df_nit[final_columns]

In [56]:
# concatenate all the placement data
df_placement = pd.concat([df_iiit, df_iit, df_nit], ignore_index=True)

In [57]:
# save the final placement csv
df_placement.to_csv("/Users/anuragchaubey/smart-college-recommender/data/merged/placement_final.csv", index=False)